//
// Created by 17595 on 2022/4/14.
//

//操作符
//算数操作符： + - * / %
//移位操作符： >>  <<
//位操作符： &（按位与）；|（按位或） ；^（按位异或）
//赋值操作符：= ； += ； -= ； *= ； /= ； &= ； ^= ； |= ； >>= ; <<= ;

//单目操作符：
// !：逻辑反操作 ； -：负值； +：正值； &：取地址； sizeof：操作树的类型长度（以字节为单位）
// ~：对一个数的二进制按位取反； --：前置、后置--； ++：前置、后置++； *：间接访问操作符（解引用操作符）
//（类型）：强制类型转换

//关系操作符： > >= < <= !=(用来测试不相等) ==(用来测试相等)

//逻辑操作符： &&(逻辑与：并且) ||(逻辑或：或者)

//条件操作符（三木操作符）：表达式1？表达式2：表达式3
//表达式1 成立，表达式2计算，整个表达式的结果是：表达式2的结果
//表达式1 不成立，表达式3计算，整个表达式的结果是：表达式3的结果
//逗号表达式：逗号隔开的一串表达式

//下标引用、函数调用和结构成员
//[] () . ->

#include <stdio.h>

//int main() {
////    int a = 9/2;//4
////    float a = 9/2.0;//4.5
////    int a  = 9%2//1 ； 对9/2取余，余数为1
//
////    int a = 2;
////    int b = a<<1;//2进制位向左移
////    printf("%d\n",b);
//
//    int a = 2;
//    a = a + 5;
//    a = 6;
//    a = a += 5;
//
//    a = a - 3;
//    a -= 3;
//    printf("%d\n", a);
//    return 0;
//}

//！操作符
//int main()
//{
//    //0 表示假，非0就是真
//    int a = 0;
//    printf("%d\n",!a);//1
//
//    if(a){
//        //如果a为真，做事
//    }
//    if(!a){
//        //如果a为假，做事
//    }
//    return 0;
//}

//int main()
//{
//    //sizeof是一个操作符
//    //不是函数
//    //计算类型或者变量的大小的
////    int a = 10;
////    printf("%lu\n", sizeof(int ));
////    printf("%d\n", sizeof(a));
//
//    //10*4 = 40
//    int arr[10] = {0};
//    printf("%d\n", sizeof(arr));//计算的是数组总大小，单位是字节
//    printf("%d\n", sizeof(arr[0]));//第一个元素大小
//
//    //计算一个数组的个数，用总数除以第一个元素得到
//    int sz = sizeof(arr)/ sizeof(arr[0]);//10
//    printf("%d\n",sz);
//    return 0;
//}

//int main() {
//    //~:按二进制位取反:把所有二进制位中数字，1变成0 ，0变成1
//    int a = 0;
//    printf("%d\n", ~a);//-1
//    return 0;
//
//}

//int main() {
////    int a  =10;
////    int b = ++a;//前置++ - 先++，后使用
////    printf("%d\n",b);//11
////    printf("%d\n",a);//11
//
////    int a  =10;
////    int b = a++;//后置++ - 先使用，后++
////    printf("%d\n",b);//10
////    printf("%d\n",a);//11
//
//    //强制类型转换
//    int a = (int) 3.14;
//    printf("%d\n",a);
//    return 0;
//}


//int main(){
//    //&&：并且
////    int a = 3;
////    int b = 0;
////    int c = a && b;
////    printf("%d\n",c);
//
//    //||：或者
//    int a = 1;
//    int b = 0;
//    int c = a || b;
//    printf("%d\n",c);
//    return 0;
//}

//条件操作符
//int main() {
//    int a = 0;
//    int b = 3;
//    int max = 0;
////    if (a > b) {
////        max = a;
////    } else {
////        max = b;
////    }
//    max = a > b ? a : b;
//    printf("%d\n",max);
//    return 0;
//}


//逗号表达式
//int main() {
////    (2, 4 + 5, 6);
//    int a = 0;
//    int b = 3;
//    int c = 5;
//            //a =5;    c=1         b=3
//    int d = (a = b + 2, c = a - 4, b = c + 2);
//    //逗号表达式，是从左向右依次计算的
//    //整个表达式的结果是最后一个表达式的结果
//    printf("%d\n",d);//3
//    return 0;
//}

//下标引用操作符
//int main(){
//    int arr[10] = {1,2,3,4,5,6,7,8,9,10};
//    printf("%d\n",arr[5]);//6 下标引用操作符
//    return 0;
//}

//函数调用操作符
int main(){
    //调用函数的时候，函数名后面的（）就是函数调用操作符
    printf("hehe\n");
    return 0;
}
