//
// Created by 17595 on 2022/4/25.
//

//二维数组
//行可以省略，列不可以省略

//1.二维数组在内存中也是连续存放的！
//一行内部连续，跨行也是连续的

#include <stdio.h>

int main() {
    //创建
    //int arr[3][4];//3行4列，每个元素是int
    //char ch[3][10];

    //初始化 - 创建的同时给赋值
    //int arr[3][4] = {1,2,3,4,5,6,7,8,9,10,11,12};
    //不完全初始化 - 后面补0
    //int arr1[3][4] = {1,2,3,4,5,6,7};
    //int arr[3][4] = {{1,2},{3,4},{4,5}};

    //行号可以省略，列不能省略 （有几行根据初始化来决定）
//    int arr[][4] = {{1,2},{3,4},{4,5}};
//    int i = 0;
//    int j = 0;
//    for (int i = 0; i < 3; i++) {
//        for (int j = 0; j < 4; j++) {
//            printf("%d ",arr[i][j]);
//        }
//        printf("\n");
//    }

    //二维数组在数组中的存储
    int arr[][4] = {{1, 2},
                    {3, 4},
                    {4, 5}};
    int i = 0;
    int j = 0;

//    for (int i = 0; i < 3; i++) {
//        for (int j = 0; j < 4; j++) {
//            printf("&arr[%d][%d] = %p\n",i,j,&arr[i][j]);
//        }
//    }
    int *p = &arr[0][0];
    for (int i = 0; i < 12; ++i) {
        printf("%d ", *p);
        p++;
    }
    return 0;
}
