//
// Created by 17595 on 2022/4/28.
//

//分类：
//1.算数操作符  + - * / %
//2.移位操作符  << >>
//3.位操作符
//4.赋值操作符
//5.单目操作符
//6.关系操作符
//7.逻辑操作符
//8.条件操作符
//9.逗号表达式
//10.下标引用、函数调用和结构成员

#include <stdio.h>

// / 操作符
//int main() {
////    int a = 3 % 5;
//    //float a = 6 / 5;
//    //printf("%f\n", a);//1.00000
//
//    float a = 6.0 / 5;
//    printf("%f\n", a);//想到得到小数得保证一个数是浮点数
//    return 0;
//}

//// % 操作符
//int main() {
//    int a = 7 % 3; // % 两端必须是整数
//    printf("%d\n", a);// 1
//    return 0;
//}

//移位操作符
//左移操作符：左边丢弃，右边补0
//右移操作符：
int main() {
//    int a = 2;
//    //把a的二进制位向左移动一位
//    int b = a << 1;
//    printf("b = %d\n", b);

    int a = 10;
    //把a的二进制位向右移动1位
    int b = a >> 1;
    printf("b = %d\n", b);
    return 0;
}
